{
  "filename": "04_network.md",
  "__html": "<p>There are mainly the following network types than the original chain network, which have different uses:</p>\n<ul>\n<li>mainnet main network: the currency of circulation is btm with real value.</li>\n<li>testnet test network: The test network for developers to conduct transactions or smart contracts.</li>\n<li>solonet test network: single-node network, not connected to other nodes, equivalent to private chain.</li>\n<li>National Secret Test Network: A network that uses the national secret encryption algorithm.</li>\n</ul>\n<p>This article will focus on the methods of compiling and starting each network, and compare the similarities and differences between several networks.</p>\n<h2>1 Compile and start the network</h2>\n<p>First of all, enter the bytom working directory and compile:</p>\n<pre><code>$ cd $GOPATH/src/github.com/bytom\n$ make bytomd\n</code></pre>\n<p>Initialize the network:</p>\n<pre><code>$ cd cmd/bytomd\n$ ./bytomd init --chain_id &lt;net-type&gt; --home &lt;config_and_data_path&gt;\n</code></pre>\n<p><code>--chain_id</code> specifies the type of network to start. There are three network types available:</p>\n<ul>\n<li>mainnet：main network</li>\n<li>testnet：wisdom test network</li>\n<li>solonet：single test network</li>\n</ul>\n<p>If you do not specify a network type, the solonet is started by default.</p>\n<p><code>--home</code> specifies the path where the configuration and data files are stored. If you do not specify a storage path, the default path for different platforms is:</p>\n<ul>\n<li>MacOS(darwin): ~/Library/Application Support/Bytom</li>\n<li>Windows(windows): ~/AppData/Roaming/Bytom</li>\n<li>Others(eg.Linux): ~/.bytom</li>\n</ul>\n<p>For example, to start solonet, specify the configuration and data file storage directory as <code>$HOME/bytom/solonet</code>:</p>\n<pre><code>$ ./bytomd init --chain_id solonet --home $HOME/bytom/solonet\n</code></pre>\n<p>The corresponding configuration file <code>config.toml</code> will appear in the <code>$HOME/bytom/solonet</code> folder:</p>\n<pre><code>$ cat $HOME/bytom/solonet/config.toml\n# This is a TOML config file.\n# For more information, see https://github.com/toml-lang/toml\nfast_sync = true\ndb_backend = &quot;leveldb&quot;\napi_addr = &quot;0.0.0.0:9888&quot;\nchain_id = &quot;solonet&quot;\n[p2p]\nladdr = &quot;tcp://0.0.0.0:46658&quot;\nseeds = &quot;&quot;\n</code></pre>\n<p>After initializing the network, start the network:</p>\n<pre><code>$ ./bytomd node --mining --home &lt;config_and_data_path&gt;\n</code></pre>\n<p>The <code>--mining</code> option specifies that mining is enabled when the node is started. If the network type specified during the initial initialization is mainnet or testnet, there is no need to open mining. If you specify solonet, it is highly recommended to start mining, otherwise it will not be packaged into the block after the transaction test.</p>\n<p>Take the startup solonet node as an example:</p>\n<pre><code>$ ./bytomd node --mining --home $HOME/bytom/solonet\n</code></pre>\n<h2>2 main network</h2>\n<p>Bytom main net.</p>\n<h2>3 wisdom test network</h2>\n<p>The name of the testnet is the wisdom, and has the ability to communicate with other nodes. When developers develop smart contracts, they need to deploy tests on the wisdom test network before they are officially released to the main network. The function of the wisdom test network is consistent with the function of the main network. The debug results obtained by the developer on the wisdom test network will also be the same as those of the main network.</p>\n<p>There are several ways for developers to obtain the test currency of the consumer:</p>\n<ul>\n<li>Turn on the <code>--mining</code> option when starting the node. The current test power of the test network is about 1~2KHash/s. It is difficult for a normal developer to use a personal computer to dig up test coins unless a professional than a raw ore is used.</li>\n<li>Contact to obtain test coins from Bytom technology operations.</li>\n<li>Test coins can be obtained from the <a href=\"http://btmdemo.ppkpub.org/joy/faucet.php\">http://btmdemo.ppkpub.org/joy/faucet.php</a> website.</li>\n</ul>\n<h2>4 solonet test network</h2>\n<p>The solonet test network is essentially a single-node network, does not connect with neighboring nodes, and its initial difficulty value is much lower than the main network and the wisdom test network. At present, the initial speed of the solonet is about 10 seconds, which ensures that developers can get network running results faster. Developers can first open the solonet for single-node mining, test their smart contracts, then go to the same test network as the main network environment for formal testing, and finally deploy the actual smart contract on the Bytom main network.</p>\n<p>Because the solonet test network is a single-node network, this node can obtain all the mining revenue as the only miner.</p>\n<h2>5 Several network differences</h2>\n<p>Individual network address prefixes:</p>\n<table>\n<thead>\n<tr>\n<th>network</th>\n<th>Address prefix</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>mainnet</td>\n<td>bm</td>\n</tr>\n<tr>\n<td>testnet</td>\n<td>tm</td>\n</tr>\n<tr>\n<td>solonet</td>\n<td>sm</td>\n</tr>\n</tbody>\n</table>\n",
  "link": "/en-us/docs/04_network.html",
  "meta": {}
}