{
  "filename": "16_transaction.md",
  "__html": "<h1>Transaction</h1>\n<h2>Introduction</h2>\n<p>​\tBlockchain consists of a set of transactions that are irreversible and linked by cryptography. Each transaction contains one or more “inputs” and “outputs”. An input can issue a new asset unit or use a existing asset unit in the previous transaction output as the source of the transfer. The output gets the asset units from the input and decides how to allocate them. A single output contains an amount of assets and a corresponding control program in order to specify how it will be spent. Also, an output can retire asset units and remove them from circulation.</p>\n<p>​\tA transaction can have multiple inputs and outputs that may contain many different types of assets, different sources, and different destinations. In a transaction, all actions (issuing, spending, receiving, and retiring assets) will be executed simultaneously as a single atomic operation. There is no timepoint that actions only partially executed.</p>\n<p>​\tIn a transaction, the total amount of assets in the input must equal the total amount of assets in the output. In order to create a new asset unit, we issue the asset in one input and receive it with one or more outputs . Also, we spend the asset in one input and receive it in one or more outputs to transfer. As for retiring, spend it in the input and destroy it in one output.</p>\n<h3>Spend the whole UTXO</h3>\n<p>​\tCreate an input, that is, a certain amount of assets are spent from a previous transaction output, and all of assets must be fully spent. If you don't want to transfer all of assets to the receiver, it is necessary to return some to your account，which is called change. Therefore, spending assets from one input often requires two outputs. One as the output of destination and one for returning the assets left. In general, Bytom will automatically manage the change output for you.</p>\n<h3>Merge UTXOs</h3>\n<p>​\tSome payments may require a lot of asset units since the amount is greater than any UTXOs. When using the account to make a purchase, as long as assets are enough in the account , Bytom will automatically select the UTXOs to satisfy the payment.</p>\n<h3>Create Transactions</h3>\n<p>​\tCreating a transaction contains three steps in total:</p>\n<pre><code>1. Build-transaction: Define what the transaction is for:  to issue an asset or to spend an asset from an account, or to use another account to receive an asset.\n</code></pre>\n<ol start=\"2\">\n<li>\n<p>Sign-transaction: Use the private key to sign the asset spending or issue new asset units.</p>\n</li>\n<li>\n<p>Submit-transaction: Submit a complete, signed transaction to the blockchain and propagate it to other nodes on the mainnet.</p>\n</li>\n</ol>\n<h4>Build-transaction</h4>\n<p>​\tYou don't have to directly manipulate input and output on Bytom, but to build transactions through several high-level actions listed below. There are six types of actions currently :</p>\n<table>\n<thead>\n<tr>\n<th>action</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>issue</td>\n<td>Issue a new asset unit</td>\n</tr>\n<tr>\n<td>spend_account</td>\n<td>Spend specified asset units from a specified account. Bytom will automatically find enough asset units from UTXOs and create an output for change.</td>\n</tr>\n<tr>\n<td>spend_account_unspent_output</td>\n<td>Specify a complete UTXO from an account. And change requires other actions.</td>\n</tr>\n<tr>\n<td>control_address</td>\n<td>Receive an asset unit in the form of address pattern.</td>\n</tr>\n<tr>\n<td>control_program</td>\n<td>Receive an asset unit in the form of contract pattern.</td>\n</tr>\n<tr>\n<td>retire</td>\n<td>Retire specified asset units</td>\n</tr>\n</tbody>\n</table>\n<h4>Sign-transaction</h4>\n<p>​\tIn order to be accepted by the blockchain, a transaction requires a valid signature contained in its input. For the input of asset issuance, the signature must correspond to the public key of the asset issuance program，and for the spending input, the signature must correspond to the public key of the control program in the output which will be spent. Transaction signatures ensure the security of blockchain, while cryptography can prevent someone to generate valid transaction signatures without the related private key.</p>\n<h4>Submit-transaction</h4>\n<p>​\tProvided that the input and output of the transaction is balanced and all inputs are signed, it is considered valid and can be submitted to the blockchain. The local node will be the first to add the transaction to the blockchain and propagate to its peers on the mainnet.</p>\n",
  "link": "/en-us/docs/16_transaction.html",
  "meta": {}
}