{
  "filename": "23_wallet.md",
  "__html": "<h2>Bytom Dashboard</h2>\n<pre><code class=\"language-no-highlight\">Open the localhost://127.0.0.1:9888\n</code></pre>\n<h2>Setup Bytom for the first-time user</h2>\n<p>Open Bytom Wallet for the first time will display the following screen:</p>\n<p><img src=\"./img/init.png\" alt=\"Init Tab\"></p>\n<p>Filled up the Account Alias, the Key Alias, enter and repeat the password\nfor the key to initialize the default account and the key .</p>\n<hr>\n<h2>Accounts</h2>\n<p>The accounts tab shows you the accounts in your wallet and allows you to create new ones.\nAn account has an Alias, ID and the xpub (which represented the related key).\nEach account can have either one or multiple keys.</p>\n<p><img src=\"./img/account.png\" alt=\"Accounts Tab\"></p>\n<hr>\n<h2>Balances</h2>\n<p>They allow you to keep separate records of your BTM and other asset in your wallet.</p>\n<p><img src=\"./img/balance.png\" alt=\"balance Tab\"></p>\n<hr>\n<h2>Key</h2>\n<p>This tab allows you to create multiple keys in a single wallet. A key matches to a password.\nThe relevant account key password will be needed when doing transactions.</p>\n<p><img src=\"./img/key.png\" alt=\"key Tab\"></p>\n<hr>\n<h2>Asset</h2>\n<p>Asset is the most important feature in Bytom. An issued asset will need a key as well.\nThe asset information will be on Blockchain.</p>\n<p><img src=\"./img/asset.png\" alt=\"asset Tab\"></p>\n<hr>\n<h2>Transactions</h2>\n<p>This tab shows a list of all transactions that have occurred involving this wallet.\nThe transaction ID can be used with the\n<a href=\"https://blockmeta.com/\">blockchain explorer</a> to see more information about the transaction.</p>\n<p><img src=\"./img/transaction.png\" alt=\"transaction Tab\"></p>\n<p>Click the arrow button on the right to view the transaction details.</p>\n<hr>\n<h2>Create Transactions</h2>\n<p>This tab is how you send funds from your local account to another address. Simply copy the recipient\naddress into the text box and type in the amount of BTM or other Asset you wish to send.\nThe estimated fee will be listed as well.</p>\n<p><img src=\"./img/normal_transaction.png\" alt=\"Normal Transaction Tab\"></p>\n<p>The Advanced Transactions allows you to send multiple different Asset and sent from different account\nto different account in one transaction.</p>\n<p><img src=\"./img/advanced_transaction.png\" alt=\"Advanced Transaction Tab\"></p>\n<hr>\n<h2>Core Status</h2>\n<p>This tab allows you to customise the units BTM amounts are displayed in.\nEnable the mining and the advanced setting.</p>\n<p><img src=\"./img/core_status.png\" alt=\"Core Status Tab\"></p>\n<hr>\n<h2>Help</h2>\n<p>The help tab links to the bytom wiki.</p>\n",
  "link": "/en-us/docs/23_wallet.html",
  "meta": {}
}