{
  "filename": "mydoc_block.md",
  "__html": "<h2>Introduction</h2>\n<p>​\tA block is a container data structure that aggregates transactions for inclusion in the public ledger, the blockchain. It is made of a header, containing metadata, followed by a long list of transactions that make up the bulk of its size. Each block references to the previous block, and all the blocks are linked from the back to the front to grow a blockchain.</p>\n<p>​\tEach block within the blockchain is identified by a hash, generated using the SHA256 cryptographic hash algorithm on the header of the block. Although a block has just one parent, it can temporarily have multiple children. That is called “fork&quot;, a temporary situation that occurs when different blocks are discovered almost simultaneously by different miners.Eventually, only one child block can become part of the blockchain.Therefore, when specifying a block by block height, there may be more than one block at the same height.</p>\n<p>​\tThe “previous block hash” field is inside the block header and thereby affects the current block’s hash when the hash of previous block has changed. Also, this in turn causes  the hash of the subsequent blocks to change, and so on. This domino effect ensures that the block won't change unless the hash of all subsequent blocks are recalculated.</p>\n<h2>Structure of a Block</h2>\n<p>The structure of the block is shown in the following table. A block mainly contains the block header and all transaction information which makes up the bulk of its size. The size of the block is much larger than the size of the block header.</p>\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Block Header</td>\n<td>Several fields form the block header</td>\n</tr>\n<tr>\n<td>Transaction Counter</td>\n<td>How many transactions follow</td>\n</tr>\n<tr>\n<td>Transactions</td>\n<td>The transactions recorded in this block</td>\n</tr>\n</tbody>\n</table>\n<h2>Structure of a Block Header</h2>\n<p>The structure of the block header is shown in the following table:</p>\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Version</td>\n<td>A version number to track software/protocol upgrades</td>\n</tr>\n<tr>\n<td>Height</td>\n<td>Height of a block</td>\n</tr>\n<tr>\n<td>Previous Block Hash</td>\n<td>A reference to the hash of the previous (parent) block in the chain</td>\n</tr>\n<tr>\n<td>Timestamp</td>\n<td>The approximate creation time of this block (seconds from Unix Epoch)</td>\n</tr>\n<tr>\n<td>Nonce</td>\n<td>A counter used for the Proof-of-Work algorithm</td>\n</tr>\n<tr>\n<td>Difficulty Target</td>\n<td>The Proof-of-Work algorithm difficulty target for this block</td>\n</tr>\n<tr>\n<td>Merkle Root</td>\n<td>A hash of the root of the merkle tree of this block’s transactions</td>\n</tr>\n</tbody>\n</table>\n<h2>Block Identifiers: Block Header Hash and Block Height</h2>\n<p>​\tThe block hash is a digital fingerprint, made by hashing the block header twice through the SHA256 algorithm.The block hash identifies a block uniquely and unambiguously and can be independently derived by any node by simply hashing the block header. Instead of including the block hash in the data of current block, it is referenced by the next block as the &quot;previous block hash&quot;.</p>\n<p>​\tA second way to identify a block is by its position in the blockchain, called the block height. The first block ever created is at block height 0, and each subsequent block is one position higher than the previous block. Unlike the block hash, the block height is not a unique identifier. Two or more blocks might have the same block height, which is called &quot;fork&quot;. In addition, the block height is contained in the data of the block.</p>\n<h2>Validate a block</h2>\n<p>​\tAs the newly solved block moves across the network, each node performs a series of tests to validate it before propagating it to its peers. This ensures that only valid blocks are propagated on the network. When a node receives a new block, it will validate the block by checking it against a long list of criteria that must all be met; otherwise, the block is rejected. That includes:</p>\n<ul>\n<li>\n<p>Check if the version of the block is greater than or equal to the version of the previous  block</p>\n</li>\n<li>\n<p>Check if the height of the block is the height of the parent block plus 1</p>\n</li>\n<li>\n<p>Check that the &quot;Previous Block Hash&quot; field is the hash of previous block</p>\n</li>\n<li>\n<p>Check that the timestamp is less than one hours in the future and not less than the intermediate time of the last 11 blocks.</p>\n</li>\n<li>\n<p>Check if the difficulty target meets the requirement</p>\n</li>\n<li>\n<p>Check that the proof of work on the block is valid</p>\n</li>\n<li>\n<p>Check if  the amount of coinbase matches the current height</p>\n</li>\n<li>\n<p>Whether the calculated Merkle root hash of the transaction is consistent with the block header</p>\n</li>\n<li>\n<p>Whether the calculated Merkle root hash of the transaction state is consistent with the block header</p>\n</li>\n<li>\n<p>Validate each transaction in the block</p>\n</li>\n</ul>\n",
  "link": "/en-us/docs/mydoc_block.html",
  "meta": {}
}